plugin -i ../../ql-iob.so
read_verilog design.v

synth_quicklogic 
stat

quicklogic_iob design.pcf ../pinmap.csv

select r:IO_TYPE=BIDIR   -assert-count 3
select r:IO_TYPE=SDIOMUX -assert-count 2
select r:IO_TYPE=        -assert-count 1

write_blif -attr -param -cname design.eblif
